#Пользователь вводит 3 числа, найти среднее арифмитическое с точностью 3

num1 = float(input('Введите 1 число: '))
num2 = float(input('Введите 2 число: '))
num3 = float(input('Введите 3 число: '))
num = num1 + num2 + num3
num = num / 3
print(round(num, 3))
