#Пользователь вводит Имя, Возраст и Город, сформировать приветственное сообщение путем форматирования 3-мя способами

#1
name = (input('Введите имя: '))
age = (input('Введите возраст: '))
city = (input('Введите город: '))
text = 'Привет {name} твой возраст {age} живешь в городе {city}'.format\
    (age=age, name=name, city=city)
print(text)

#2
name = str(input('Введите имя: '))
age = str(input('Введите возраст: '))
city = str(input('Введите город: '))
print("Привет %(name)s твой возраст %(age)s живешь в городе %(city)s"
      %{"name":name, "age":age, "city":city})

#3
name = str(input('Введите имя: '))
age = str(input('Введите возраст: '))
city = str(input('Введите город: '))
print(f'Привет {name} твой возраст {age} живешь в городе {city}')
