#Без использования collections, написать программу, которая будет
#создавать словарь для подсчитывания количества вхождений каждой
#буквы в текст введенный с клавиатуры

str = (input('Введите предложение: '))
unique = dict(zip(list(str),[list(str).count(i) for i in list(str)]))
print("Вхождения: ",unique)
