#Код Морзе для представления цифр и букв использует тире и точки. Напишите
#функцию для кодирования текстового сообщения в соответствии с кодом Морзе.

morse = {'A': '.-',     'B': '-...',   'C': '-.-.',
        'D': '-..',    'E': '.',      'F': '..-.',
        'G': '--.',    'H': '....',   'I': '..',
        'J': '.---',   'K': '-.-',    'L': '.-..',
        'M': '--',     'N': '-.',     'O': '---',
        'P': '.--.',   'Q': '--.-',   'R': '.-.',
        'S': '...',    'T': '-',      'U': '..-',
        'V': '...-',   'W': '.--',    'X': '-..-',
        'Y': '-.--',   'Z': '--..',
        '0': '-----',  '1': '.----',  '2': '..---',
        '3': '...--',  '4': '....-',  '5': '.....',
        '6': '-....',  '7': '--...',  '8': '---..',
        '9': '----.'}

def Morse(s):
    a = ''
    for i in s.upper():
        if i in morse.keys(): a += morse[i] + ' '
        if i == ' ': a += ' / '  
    return a


def get_key(val, dct):  
    for key, value in dct.items():
        if val == value: return key


def MorseTxt(s):
    a, s = '', s.split()
    for i in s:
        if i in morse.values(): a += get_key(i, morse)
        if i == '/': a += ' '
    return a


a = input()
print(Morse(a))
