#Написать программу генерации треугольника паскаля указанной глубины

n = int(input("Введите количество строк: "))

for i in range(n):
    print(' ' * (n - i), end='')
    print(' '.join(map(str, str(11 ** i))))
