#Создайте функцию, которая будет принимать две строки, a и b, 
#и возвращать количество раз, когда в обеих строках под одинаковыми 
#индексами стоит одна и та же пара букв.

x = input('Введите первую строку: ')
y = input('Введите вторую строку: ')

def str_letter(x, y):
    return sum([1 for i in range(len(x)-1) if x[i:i+2] == y[i:i+2]])

print(str_letter(x, y))
